# SpatialBoundaryElement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementBoundarySubface..::..SpatialBoundaryElement Property
SpatialElementBoundarySubface Class See Also
---
Element that gave rise to this room face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public LinkElementId SpatialBoundaryElement { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SpatialBoundaryElement As LinkElementId
	Get
```

Visual C++
---
```text
public:
property LinkElementId^ SpatialBoundaryElement {
	LinkElementId^ get ();
}
```

# See Also
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace